app/controllers/information_controller.rb

  def index
    @information = Information.all
---
SELECT "information".* FROM "information"

  def create
    @information = Information.new(information_params)

    respond_to do |format|
      if @information.save
---
INSERT INTO "information" ("email", "pass", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "asdasd"], ["pass", nil], ["created_at", "2023-10-23 05:03:19.301545"], ["updated_at", "2023-10-23 05:03:19.301545"]]

    def set_information
      @information = Information.find(params[:id])
---
SELECT "information".* FROM "information" WHERE "information"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]